-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: sql311.byetcluster.com
-- Generation Time: Jun 25, 2025 at 11:29 PM
-- Server version: 11.4.7-MariaDB
-- PHP Version: 7.2.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ezyro_38091339_dataleavetrack`
--

-- --------------------------------------------------------

--
-- Table structure for table `leaveem`
--

CREATE TABLE `leaveem` (
  `id` int(11) NOT NULL,
  `idemployee` varchar(255) NOT NULL,
  `employeename` varchar(255) DEFAULT NULL,
  `leavetype` varchar(255) CHARACTER SET utf32 COLLATE utf32_general_ci DEFAULT NULL,
  `startdate` date DEFAULT NULL,
  `numlavet` varchar(255) DEFAULT NULL,
  `reason` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `leaveem`
--

INSERT INTO `leaveem` (`id`, `idemployee`, `employeename`, `leavetype`, `startdate`, `numlavet`, `reason`) VALUES
(20, '5018849', 'à¸™à¸²à¸¢à¸£à¸Šà¸²à¸™à¸™à¸—à¹Œ à¸—à¸±à¸šà¸‡à¸²à¸¡', 'à¸¥à¸²à¸à¸´à¸ˆ', '2567-10-01', '1', '008/0358 à¹„à¸›à¸—à¸³à¸˜à¸¸à¸£à¸°à¸•à¹ˆà¸²à¸‡à¸ˆà¸±à¸‡à¸«à¸§à¸±à¸”'),
(21, '5035171', 'à¸™à¸²à¸¢à¸¢à¸¨à¸•à¸£à¸°à¸à¸²à¸£ à¹à¸ªà¸™à¸—à¸§à¸µ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-01', '1', '063/3111 à¹à¸žà¸—à¸¢à¹Œà¸™à¸±à¸”à¹€à¸ˆà¸²à¸°à¹€à¸¥à¸·à¸­à¸”'),
(22, '5036859', 'à¸™à¸²à¸¢à¸™à¸¤à¹€à¸šà¸¨ à¹à¸à¹‰à¸§à¸ªà¸²à¸¢à¸—à¸­à¸‡', 'à¸¥à¸²à¸à¸´à¸ˆ', '2567-10-01', '1', '063/3120 à¸žà¸²à¸¥à¸¹à¸à¸Šà¸²à¸¢à¹„à¸›à¸žà¸šà¹à¸žà¸—à¸¢à¹Œ'),
(23, '5030664', 'à¸™à¸²à¸¢à¸¡à¸°à¸™à¸¹à¸ à¸žà¸¹à¸¥à¸šà¸¸à¸', 'à¸¥à¸²à¸à¸´à¸ˆ', '2567-10-02', '1', '063/3121 à¸™à¹‰à¸³à¸—à¹ˆà¸§à¸¡à¸‚à¹‰à¸²à¸§'),
(24, '5030664', 'à¸™à¸²à¸¢à¸¡à¸°à¸™à¸¹à¸ à¸žà¸¹à¸¥à¸šà¸¸à¸', 'à¸¥à¸²à¸à¸´à¸ˆ', '2567-10-03', '1', '063/3121 à¸™à¹‰à¸³à¸—à¹ˆà¸§à¸¡à¸‚à¹‰à¸²à¸§'),
(25, '5032891', 'à¸™à¸²à¸¢à¸­à¸ à¸´à¸Šà¸²à¸•à¸´ à¸›à¸´à¹ˆà¸™à¸”à¸­à¸à¹à¸à¹‰à¸§', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-04', '1', '063/3122 à¹à¸žà¸—à¸¢à¹Œà¸™à¸±à¸”à¹€à¸ˆà¸²à¸°à¹€à¸¥à¸·à¸­à¸”'),
(26, '5013334', 'à¸™.à¸ª.à¸£à¸±à¸•à¸™à¸² à¹€à¸Šà¸·à¹‰à¸­à¸™à¸žà¸„à¸¸à¸“', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-08', '1', '065/3233 à¹„à¸›à¸«à¸²à¸«à¸¡à¸­à¹‚à¸£à¸‡à¸žà¸¢à¸²à¸šà¸²à¸¥'),
(27, '5011617', 'à¸™à¸²à¸‡à¸žà¸£à¸£à¸“à¸¥à¸±à¸à¸©à¸“à¹Œ à¸šà¸¸à¸à¸£à¸²à¸¨à¸£à¸µ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-02', '1', '065/3237 à¸›à¸§à¸”à¸«à¸±à¸§'),
(28, '5011617', 'à¸™à¸²à¸‡à¸žà¸£à¸£à¸“à¸¥à¸±à¸à¸©à¸“à¹Œ à¸šà¸¸à¸à¸£à¸²à¸¨à¸£à¸µ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-10', '1', '065/3238 à¸«à¸¡à¸­à¸™à¸±à¸”'),
(29, '5015536', 'à¸™.à¸ª.à¹€à¸ªà¸²à¸§à¸£à¸ª à¹€à¸«à¸¡à¹‡à¸™à¸šà¸¹à¹ˆ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-01', '1', '065/3235 à¹€à¸¥à¸·à¸­à¸”à¸­à¸­à¸à¸Šà¹ˆà¸­à¸‡à¸„à¸¥à¸­à¸”'),
(30, '5015536', 'à¸™.à¸ª.à¹€à¸ªà¸²à¸§à¸£à¸ª à¹€à¸«à¸¡à¹‡à¸™à¸šà¸¹à¹ˆ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-02', '1', '065/3235 à¹€à¸¥à¸·à¸­à¸”à¸­à¸­à¸à¸Šà¹ˆà¸­à¸‡à¸„à¸¥à¸­à¸”'),
(31, '5015536', 'à¸™.à¸ª.à¹€à¸ªà¸²à¸§à¸£à¸ª à¹€à¸«à¸¡à¹‡à¸™à¸šà¸¹à¹ˆ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-03', '1', '065/3235 à¹€à¸¥à¸·à¸­à¸”à¸­à¸­à¸à¸Šà¹ˆà¸­à¸‡à¸„à¸¥à¸­à¸”'),
(32, '5015536', 'à¸™.à¸ª.à¹€à¸ªà¸²à¸§à¸£à¸ª à¹€à¸«à¸¡à¹‡à¸™à¸šà¸¹à¹ˆ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-04', '1', '065/3235 à¹€à¸¥à¸·à¸­à¸”à¸­à¸­à¸à¸Šà¹ˆà¸­à¸‡à¸„à¸¥à¸­à¸”'),
(33, '5015536', 'à¸™.à¸ª.à¹€à¸ªà¸²à¸§à¸£à¸ª à¹€à¸«à¸¡à¹‡à¸™à¸šà¸¹à¹ˆ', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-05', '1', '065/3235 à¹€à¸¥à¸·à¸­à¸”à¸­à¸­à¸à¸Šà¹ˆà¸­à¸‡à¸„à¸¥à¸­à¸”'),
(34, '5044937', 'à¸™à¸²à¸¢à¸˜à¸µà¸£à¸žà¸‡à¸©à¹Œ à¸ˆà¸´à¹‹à¸§à¹€à¸‚à¹‡à¸¡', 'à¸¥à¸²à¸›à¹ˆà¸§à¸¢', '2567-10-05', '1', '065/3232 à¹€à¸›à¹‡à¸™à¹„à¸‚à¹‰');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `leaveem`
--
ALTER TABLE `leaveem`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `leaveem`
--
ALTER TABLE `leaveem`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=35;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
